
{
	
    "education": [
        {
            "start": "2013",
            "end": "2017",
            "title": "Durham University",
            "description": "1st Class Honours Masters degree in Natural Sciences (studying Computer Science and Maths) attaining 80% Overall"
        },
        {
            "start": "2011",
            "end": "2013",
            "title": "Toot Hill College",
            "description": "2 A*s, 2 As in Maths, Further Maths, Physics and Chemistry"
        }
    ],
	"experience": [
		{
			"start": "Dec 2021",
			"end": "",
			"company": "ASOS.com",
			"title": "Senior Software Engineer",
			"description": [
				"Lead the successful expansion of the Partner Fulfils project to over <b>40 brands</b> - including New Balance, Vans, Superdry and Ann Summers - and across <b>4 new countries</b>, now handling <b>3% of ASOS' global orders</b> and bringing significant revenue for the company.",
				"Played a central role in team expansion through candidate <b>interviewing</b>, <b>assessing</b>, <b>mentoring</b>, and <b>onboarding</b> newly hired engineers as well as internal moves to the team.",
				"Took a proactive role in business and <b>architectural</b> decisions, delivering on priorities by managing <b>stakeholder expectations</b>, <b>delegating</b>, and <b>communicating</b> effectively across multidisciplinary teams.",
				"Achieved the \"all-rounder\" award in recognition for my consistent impact and support for those in and outside my team."
			],
			"links": [
				"https://www.mirakl.com/news/asos-expands-partner-fulfils-programme-in-partnership-with-mirakl",
				"https://www.asosplc.com/news/asos-launches-non-full-price-partnership-secret-sales"
			]
		},
		{
			"start": "Nov 2019",
			"end": "Nov 2021",
			"company": "ASOS.com",
			"title": "Software Engineer",
			"description": [
				"Delivered the Partner Fulfils project within 6 months for 2 brands: Adidas and Reebok, enabling the brands to ship directly to the customer, expanding the range and availability of products, and maximising demand conversion, customer choice and stock availability. In the first year this grew to make up <b>11% of Adidas orders</b> and <b>10% of Reebok sales</b> in the UK.",
				"Influenced the design of <b>Logic Apps</b> by feeding back our experiences and recommendations in weekly catchups with the product team at <b>Microsoft</b>.",
				"<b>Collaborated</b> in a cross-team effort to deliver Ratings and Reviews - projected to reduce returns and increase conversion rate with a corresponding effect on profitability.",
				"Delivered a new solution for ingesting customer metrics, reducing the lead time for leveraging these from days to minutes, which allowed more value to be extracted from this data.",
				"Delivered internal <b>training</b> sessions on <b>Docker</b>, <b>AKS</b> and <b>containerisation</b> to other employees, driving the company's ambition to be at the cutting edge of tech."
			]
		},
		{
			"start": "Mar 2019",
			"end": "Oct 2019",
			"company": "ASOS.com",
			"title": "Associate Software Engineer",
			"description": [
				"Contributed to a number of projects, delivering high quality, well tested code by applying <b>TDD</b> and <b>SOLID</b> principles, and helping to deliver them to their deadline.",
				"Became a member of the support team, debugging and fixing issues outside of office hours when incidents occurred.",
				"Quickly picked up domain and technical knowledge to make an impact early on, aiding the team as an engineer and problem-solver.",
				"Facilitated collaboration and communication through clearly articulated ideas and constructive engagement with others."
			]
		},
		{
			"start": "Oct 2017",
			"end": "Feb 2019",
			"company": "Nottinghamshire County Council",
			"title": "Software Engineer",
			"description": [
				"Delivered a full-stack solution which facilitated vulnerable patients to be transferred from hospital into home care quicker, abstracting the legacy software from the users through a functional and usable UI.",
				"Took a leading role in <b>architectural</b> decisions and defining work, applying this to the successful delivery of projects ranging from pothole reporting to local politician indexes."
			]
		},
		{
			"start": "Jul 2016",
			"end": "Sep 2016",
			"company": "Apple",
			"title": "Software Engineer Internship",
			"description": [
				"Developed a full-stack solution that would improve the efficiency of working with Apple's <b>Agile</b> ticketing system.",
				"Gained vital insights into how tech giants structure their engineering practices."
			]
		},
		{
			"start": "Jun 2015",
			"end": "Sep 2015",
			"company": "CEM: Centre for Evaluation & Monitoring",
			"title": "Software Engineer Internship",
			"description": [
				"Developed a full-stack tool that streamlines teams' interactions with organisational data.",
				"Gained hands-on experience with <b>C#</b>, <b>SQL</b>, <b>JavaScript</b> and frontend libraries."
			]
		}
	],
	"summary": "Accomplished Senior Software Engineer with over <b>6 years</b> of experience in a variety of technical domains specialising in <b>Azure</b> and <b>.NET Core</b>, with strong foundations in <b>Python</b>, <b>React</b>, <b>SQL</b> and <b>NodeJS</b>. Proven ability as a <b>team leader</b>, <b>mentor</b>, and key contributor, driving high-impact projects to success within <b>agile</b> and ever-evolving business environments. Passionate about personal growth, quality work, and engaging in diverse interests such as music production, digital art, electronics, AI, and web development.",
	"skills": [
		{
			"skills": [
				"C#",
				"Microsoft Azure",
				".NET Core",
				"Python",
				"Azure Kubernetes Service (AKS)",
				"Stream Analytics",
				"Application Insights",
				"Grafana",
				"Durable Functions",
				"Azure Databricks",
				"Azure Functions",
				"Azure Cosmos DB",
				"Terraform",
				"React.js",
				"SQL",
				"JavaScript",
				"HTML",
				"Java",
				"Node.js",
				"Angular",
				"Logic Apps"
			],
			"category": "Tools & Technologies"
		},
		{
			"skills": [
				"Architecture",
				"Test-Driven Development",
				"Agile Methodologies",
				"SOLID Design Principles",
				"System Monitoring"
			],
			"category": "Industry Knowledge"
		},
		{
			"skills": [
				"Team Leadership",
				"Stakeholder Management",
				"Team Coordination",
				"Presentation",
				"Coaching",
				"Mentoring"
			],
			"category": "Interpersonal Skills"
		}
	],
    "certifications": [
        {
            "title": "Microsoft Certified: Azure Developer Associate",
            "issuer": "Microsoft",
            "date": "May 2021",
            "link": "https://www.credly.com/badges/145820fd-1272-480f-88e1-2ff7a9675847"
        }
    ],
    "projects": [
        {
            "title": "Hitbox",
            "date": "Jun 2020",
            "description": "Hitbox is a symmetric, multiplayer, browser-based brawler game. Every player has the same abilities and move set, meaning it's purely skill-based.",
            "link": "https://www.hitbox.online"
        },
        {
            "title": "Text Trek",
            "date": "Sep 2023",
            "description": "Text Trek is a community-based, AI-driven text based adventure game. Imagine huge persistent worlds spanning centuries, characters finding artifacts from past generations, and thrilling open-ended plotlines with atmospheric artwork.",
            "link": "https://texttrek.z16.web.core.windows.net"
        }
    ],
    "awards": [
        {
            "date": "Jun 2017",
            "title": "Natural Sciences Finalist for Outstanding Academic Achievement in Computer Science"
        },
        {
            "date": "Jun 2017",
            "title": "Natural Sciences MSci Award for Outstanding Achievement"
        }
    ]
}